[
  {
    "id": 1,
    "title": "GLITTERATI",
    "date": "Coming Soon",
    "image": "https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628490/glitterati_zwmsaw.webp",
    "regLink":"https://forms.gle/9t6THsfqHKYvt6G2A",
    "description": "Where fabric meets fantasy and the runway becomes a realm of bold expression, Glitterati is the ultimate celebration of fashion at Incandescence. From edgy western silhouettes to elegant traditional drapes, from raw tribal aesthetics to regal bridal and groom ensembles, designers bring their visions to life through stunning creations. As students take the ramp, confidence turns into couture and attitude into art. Every step tells a story, every look makes a statement. It’s not just about style-it’s about presence, passion, and power. Glitterati is where trends are born, boundaries are broken, and the spotlight belongs to those who long to shine."
  },
  {
    "id": 2,
    "title":"PROM NIGHT",
    "date":"Coming Soon",
    "image":"/pic.jpg",
    "regLink":"",
    "description":"Some nights feel like they’re written just for two- PROM NIGHT is one of them. Soft lights glow like quiet promises, candles flicker between shared smiles, and the music plays low enough for hearts to do the talking. Somewhere between holding hands and swaying close, the world slows down, just enough for love to catch its breath. With a whisper of Parisian romance woven into every corner, this night asks not for grand vows, but for the smallest of wonders , a shared laugh, a lingering glance, a single step taken as one. Soadorn thy finest silks, offer thy hand in quiet promise, and let the evening unfold as softly as a tale told by candlelight. For some memories are not forged by time, but sealed by the heart."
  },
  {
    "id": 3,
    "title": "COSTOPIA",
    "date": "Coming Soon",
    "image": "https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629527/cosplay_kdpo9y.webp",
    "regLink":"https://docs.google.com/forms/d/e/1FAIpQLSeJIXBi72VNGhbfkkr8WcOYRNhADWVdUXofn8UOKYoli6yC5w/viewform?usp=header",
    "description": "“Genjitsu o koete, kyarakutā ni naru.”\n(Go beyond reality, become the character!)\n\nNot just costumes, characters unleashed! Cosplay is where imagination jumps off the screen and struts into real life. From iconic superheroes and anime legends to fantasy favorites and pop-culture classics, participants don’t merely dresAs the part, they live it. Every detail is deliberate, every pose tells a story, and every entrance earns a second look. It’s creative, playful, and delightfully dramatic, turning fandom into performance and passion into art. Whether you’re here to compete, perform, or admire the craftsmanship, Cosplay celebrates confidence, creativity, and bold self-expression. Because sometimes, stepping into another world is the most stylish way to stand out in this one."
  },
  {
    "id": 4,
    "title":"कवि Sammelan",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628511/kavi_sammelan_hyy3yc.webp",
    "regLink":"",
    "description":"Kavi Sammelan is where raw voices and rooted stories come together through poetry. Drawing inspiration from indigenous rhythms, lived experiences, and modern perspectives, this gathering celebrates expression in its most honest form. Humour meets reality, emotions flow freely, and every verse carries the spirit of identity, resilience, and belonging. Blending the ancestral with the contemporary, poets take the stage to share stories that resonate with today’s youth–bold, reflective, and real. At Incandescence, Kavi Sammelan becomes a space where words connect generations and poetry feels alive."
  },
  {
    "id": 5,
    "title":"Carnival of Bites",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628470/carnival_cqznfh.webp",
    "regLink":"",
    "description":"As the lanterns glow and the air fills with tempting aromas, a feast unlike any other begins to unfold. Carnival of Bites invites you into a vibrant bazaar of flavours, where every stall tells a story and every dish carries a promise. From rich, savoury delights to indulgent sweet endings, each bite is a journey waiting to be taken. Spices dance, grills whisper, and kitchens come alive, drawing you closer with every step. So tell us, are you ready to follow the scent and discover where it leads? Come with an appetite, leave with a smile, and carry the taste with you long after the feast ends. Carnival of Bites, where every bite becomes a tale worth remembering."
  },
  {
    "id": 6,
    "title":"FlashMob",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628487/flashmob_soemod.webp",
    "regLink":"",
    "description":"No stage, no warning–just when the crowd least expects it, the beats take over!\n\nLed by the electrifying dancers of Aaveg, the Dance Club of NIT Silchar, Flash Mob is where precision amalgamates with chaos and magic erupts in motion.\nAt buzzing hotspots like Golddighi Mall, Silchar, unsuspecting crowds are swept into the spectacle as razor-sharp synchrony, explosive energy, and fearless expressions hijack everyday spaces and turn them into pulsating stages. No tickets. No curtains. Just raw surprise and unstoppable vibes. Bold, breathtaking, and impossible to ignore, Flash Mob leaves the city buzzing long after the final beat hits."
  },
  {
    "id": 7,
    "title":"Pump it up",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628514/pump_it_up_oyk0kn.webp",
    "regLink":"https://docs.google.com/forms/d/e/1FAIpQLSdcnmOo5o-3sngViEikfPCkYIsTrG_pBfdWjJq1y4c2mSivjw/viewform",
    "description":"Pump It Up isn’t just a run-of-the-mill dance battle—it’s a freestyle frenzy where rules loosen, instincts take charge, and personality steals the show. This is where dancers ditch the predictable, bend the beat, and let their moves speak their truth. The floor turns into a living canvas, with every step leaving a signature and every spin saying turning heads. More than a competition, Pump It Up is a high-energy celebration of individuality, rhythm, and the sheer joy of moving your own way. Driven by music and adrenaline, Pump It Up blends fitness, fun, and high-octane vibes into one electrifying experience. "
  },
  {
    "id": 8,
    "title":"GROUND ZERO",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628486/ground_zero_cb5y5b.webp",
    "regLink":"https://docs.google.com/forms/d/e/1FAIpQLSdcnmOo5o-3sngViEikfPCkYIsTrG_pBfdWjJq1y4c2mSivjw/viewform",
    "description":"Ground Zero is a high-voltage hip hop dance showdown at Incandescence 2026, presented under the Natraaj module. Built around open style and breaking, the competition brings raw energy, fierce movement, and unfiltered expression to the stage. With dancers pushing boundaries through power, precision, and individuality, the floor comes alive with rhythm and attitude. As the lights blaze and the crowd surges with every round, Ground Zero stands as a charged celebration of hip hop culture and competitive spirit, making it one of the most electrifying moments of the festival"
  },
  {
    "id": 9,
    "title":"Kaladarshan",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628527/kala_darshan_fotqcf.webp",
    "regLink":"https://docs.google.com/forms/d/e/1FAIpQLSf4ulmqho2J2Ii-9mXjUWKqoUH_b4akv67kWtrhrl_MqtTtcg/viewform?usp=header",
    "description":"Every wall listens, every canvas speaks –Kala Darshan, where colours whisper, ideas breathe and imagination reigns!\nArt has a way of speaking when words fall short. Kala Darshan is a space where creativity takes form through colours, textures, and ideas shaped by experience and imagination. The exhibition brings together myriad artworks that have strokes from contemporary, abstract, traditional, nature, and many more genres, blending with a personal touch. From detailed illustrations to thoughtful compositions, each piece reflects emotion, culture, and the stories artists carry within them. At Kala Darshan art is not just display, but a reflection of voices, memories, and meaning."
  },
  {
    "id": 10,
    "title":"DEPRADOR",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629506/deprador_rtikzt.webp",
    "regLink":"",
    "description":"Deprador is the ultimate debate battlefield where intellect becomes armor, expression becomes weaponry, and brilliance commands victory. Every participant enters as a warrior of thought, echoing the timeless truth that strategy and wisdom conquer where force cannot. Whether examining the socio‑economic pulse of the world or unraveling the philosophical knots of law, this arena challenges participants to dissect, defend, and redefine perspectives, transforming debate into a dynamic battlefield of intellect and daring expression, where every word matters and every idea has the power to ignite."
  },
  {
    "id": 11,
    "title":"NITSMUN",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629506/nitsmun_n9lvj9.webp",
    "regLink":"https://docs.google.com/forms/d/1f3_WN6S32tKzuNUxtVeec4yzSyJ8HA65VdDue9VDNhk/viewform",
    "description":"NITSMUN is where diplomacy comes alive, sharp, immersive, and unapologetically engaging. It brings together curious minds and confident voices to explore the complexities of global politics, historical narratives, and the realities shaping today’s world. More than just debate, NITSMUN is a space for dialogue that challenges perspectives and inspires thoughtful action.\n\nFrom high-intensity committee sessions to interactive press and media engagements, delegates sharpen their skills in policy analysis, negotiation, and persuasive communication. Every motion debated, every resolution drafted, and every argument defended adds depth to leadership and clarity to thought.\n\nNITSMUN nurtures informed thinkers and articulate leaders—individuals equipped to influence discourse, navigate complexity, and contribute meaningfully to conversations that shape the future."
  },
  {
    "id": 12,
    "title":"SOKRATIC",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629506/sokratik_froyar.webp",
    "regLink":"https://forms.gle/6B8rK1dxLqwkkwmt6",
    "description":"Where curiosity meets competition, SOKRATIK shines as one of the defining highlights of Incandescence’26. Spanning two vibrant days, it celebrates curiosity and is an echo of wisdom through an exciting lineup of quizzes that span a wide landscape of knowledge. This enthralling quiz, previously helmed by remarkable quizmasters such as Bhushan Patel, Somnath Chanda, Abhra Das, Titash Banerjee, and many others known for their dynamic style and deep expertise, SOKRATIK promises an atmosphere charged with energy and friendly rivalry. With enticing prizes at stake, participants are driven to bring their sharpest thinking to the table. The air fills with the familiar rhythm of tapping pens, racing timers, thoughtful silences, triumphant cheers, and narrow misses. As SOKRATIK unfolds, it becomes a vibrant carnival of captivating and mind-bending questions, leaving behind moments of brilliance and a celebration of intellect that lingers well beyond the final round."
  },
  {
    "id": 13,
    "title":"DARPAN",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629497/darpan_ukwvr2.webp",
    "regLink":"",
    "description":"Presented by Obiettivo, the Photography Club of NIT Silchar, Darpan captures life – as it quietly unfolds around us – through the lens. It brings focus to moments that usually slip past unnoticed,soft emotions, intricate details, and genuine human connections. From still corners of the city to faces rich with expression, each photograph narrates a story shaped by real people and real experiences. Together, these frames create a visual reflection that feels sincere and grounded. As you explore the exhibition, slow down and take it in, allowing the images to guide you through a thoughtful journey where meaning extends far beyond what meets the eye."
  },
  {
    "id": 14,
    "title":"MELODIES OF INCAND",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629503/melodies_a2suyw.webp",
    "regLink":"https://docs.google.com/forms/d/e/1FAIpQLSffa6k9W4RAdOTGbrcs48OcZlUsfEmAIOrBbi04OjSqN_rMDA/viewform?usp=dialog",
    "description":"Before Incandescence comes alive on stage, music finds its first voice here. This online musical showcase marks the beginning of the festival journey, creating a space where voices and melodies are shared beyond the limits of a live stage. Performances unfold online, with audience votes and expert evaluation together shaping which acts move forward in the festival journey.\nThe performers are featured on the official Incandescence page, earning wider recognition and a lasting spotlight. As the opening note of the festival, this platform sets the rhythm where music begins as expression and connection."
  },
  {
    "id": 15,
    "title":"BATTLE OF BANDS",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629504/battle_pbae52.webp",
    "regLink":"https://docs.google.com/forms/d/e/1FAIpQLSfofpKTRKKrARLlvsZbdkb4yvyEjKwxP0UEaeKZjdqT_CSdNA/viewform?usp=dialog",
    "description":"When amplifiers roar and drumbeats thunder, Battle of Bands transforms the stage into a battlefield of sound. This pulse-pounding competition brings together talented bands ready to clash with riffs, rhythms, and raw energy. From soul-stirring melodies to head-banging anthems, each performance is a statement of identity, passion, and power. Bands push their limits, experiment with sounds, and own the spotlight as the crowd fuels the frenzy. It’s not just about volume or speed–it’s about presence, precision, and leaving a mark. Battle of Bands is where music meets rivalry, creativity meets courage, and only the most unforgettable sound rises above the rest. "
  },
  {
    "id": 16,
    "title":"Indie Unplugged",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629524/indie_xb4nx3.webp",
    "regLink":"",
    "description":"As twilight folds its velvet wings across the sky, we gather in a sanctuary of sound. The earth exhales, the stars lean closer, and silence becomes the stage upon which whispers turn into music. Here, every lyric is a lantern, glowing softly against the dark, leading us into harmony. In a corner of the campus, lanterns glow and bonfires crackle. Voices from all parts of the nation rise on this stage, not only to compete, but to connect, to listen, and to discover themselves in one another’s melodies. Music drifts like tides, enfolding us in its embrace, and together they light the night with unity that goes beyond rivalry. As the music rises and the night deepens, the sweetest moments unfold. Unrehearsed, and memorable."
  },
  {
    "id": 17,
    "title":"THESPIAN RHAPSODY",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629525/thespian_ebczj6.webp",
    "regLink":"",
    "description":"Acting that breathes, feels and stays, and emotions take the lead : The Thespian Rhapsody is a celebration of storytelling in its purest form. Organized by Advay, the Drama Club of NIT Silchar, this is where stories breathe and emotions come alive on stage. The space transforms through movement, dialogue, and silence, shaping performances that feel deeply human. From powerful monologues to carefully layered scenes, each act carries fragments of life, imagination, and lived experience.\n\nAs the lights rise and the curtain opens, performers step into moments of love, conflict, hope, and struggle. Every gesture, pause and expression adds meaning beyond words. Here, drama is not merely performed–it is felt, remembered and carried forward long after the applause fades. "
  },
  {
    "id": 18,
    "title":"ESPREMEIRE",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629532/espremiere_cprzpv.webp",
    "regLink":"https://forms.gle/hJuVGfgnB6FtPksY6",
    "description":"Step into the spotlight with Espremiere, where your acting skills and personality come alive on stage. This is your opportunity to share compelling stories, express a wide range of emotions, and fully own the spotlight with a performance that connects deeply with the audience. From subtle expressions to powerful dialogues, every moment is a chance to leave a lasting impression and create an unforgettable experience. Push your creative boundaries by experimenting with diverse characters, accents, and emotional depths, and let your individuality shape your performance. Designed to challenge, inspire, and excite, Espremiere promises a thrilling journey that elevates your craft, captivates the audience, and helps you take your acting skills to the next level."
  },
  {
    "id": 19,
    "title":"Nukkad नाटक",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629531/nukkad_v7aqqd.webp",
    "regLink":"",
    "description":"Enter the world of Nukkad Natak, where the voices of the people transform routine realities into extraordinary visions. With fierce dialogues, raw performances, and themes that cut to the bone, the drama here is unmasked, untamed, and alive.These performances shine a light on issues that matter, making the ordinary feel extraordinary and leaving the audience with something to think about.\nWatch as stories rise from the dust of the street: challenging traditions, shattering illusions, and celebrating the restless spirit of change, all delivered with the infectious energy of the performers. The street is their stage, the people their chorus, and the play itself the cry of those long unheard."
  },
  {
    "id": 20,
    "title":"RAZZ MATAZZ",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769629530/razzmataz_twhpep.webp",
    "regLink":"",
    "description":"A vibrant celebration crafted for school students, Razzmatazz bursts with colour, creativity, and youthful energy. The event brings together music, dance, games and cultural performances in a lively mix that keeps excitement flowing from start to finish. It’s a space where talents are explored, friendships are formed, and confidence finds its stage. Every activity adds to an atmosphere buzzing with laughter and enthusiasm, turning simple moments into lasting memories. Designed to celebrate curiosity, expression, and joy, Razzmatazz captures the spirit of youth in its most dynamic form–playful, expressive, and endlessly energetic."
  },
  {
    "id": 21,
    "title":"MR. NIT",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628512/mr_nit_wczhcx.webp",
    "regLink":"",
    "description":"More than just a display of muscle, Mr. NIT is a story of grit, discipline, and quiet determination. This powerlifting competition brings together individuals who have spent countless hours training their bodies and minds to lift heavier, push harder, and stay focused under pressure. Every lift carries effort, patience, and belief, while every moment on the platform tests strength beyond the physical. It’s about balance, technique, and the courage to challenge one’s own limits. With the crowd watching in awe, Mr. NIT celebrates resilience, dedication, and the spirit of becoming stronger, inside and out."
  },
  {
    "id": 22,
    "title":"UNSTITCHED",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628501/unstitched_sudecm.webp",
    "regLink":"https://docs.google.com/forms/d/e/1FAIpQLSfwEwArOk_UnW0kygCXll1_wawNBE7sry3Hj7JymBSwkPv22w/viewform?usp=dialog",
    "description":"Step into a realm where fashion defies rules and imagination reigns. Unstitched invites you to design striking costumes without a single stitch, transforming everyday materials into bold wearable art. This challenge tests your ability to think, build, and create without fabric, needle, or thread.\nArmed with raw creativity and unconventional resources, participants craft garments using newspapers, plastic, cardboard, foil, and more. With smart techniques like gluing, pinning, clipping, and assembling, each design blends visual appeal, structural brilliance, innovation and sustainability.\nMore than a competition, Unstitched is a celebration of resourceful thinking and artistic vision. Inspired by culture, avant-garde ideas, or futuristic concepts, this platform lets you turn ordinary waste into extraordinary fashion and redefine what style truly mean."
  },
  {
    "id": 23,
    "title":"CYPHER the rap battle",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628469/cypher_fe7pbq.webp",
    "regLink":"https://forms.gle/tnnAXNE4qXphryV86",
    "description":"Lights rise, beats roll in, and the stage is set.\n\nCypher is a head-to-head rap competition where artists face off, exchanging verses on spot. No scripts, no second takes; just instinct, timing, and nerve. Every word is a move, every pause a weapon. Lines are exchanged like sparks, bars move fast, flows switch up, and presence speaks louder than volume.\nOne moment can flip the room, one verse can change the game.\nSo, when the spotlight is on you, make the mic drop because “you only get one shot."
  },
  {
    "id": 24,
    "title":"CANVAS",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628488/canvas_oo0cus.webp",
    "regLink":"https://docs.google.com/forms/d/e/1FAIpQLSfLCEjb8AMEC3hZ7aXsaRNCjrnElhV5AEUaRJf__V_mwZTQtg/viewform?usp=publish-editor",
    "description":"Canvas is a creative platform that celebrates the art of visual expression through live sketching and wearable art. It allows artists to transform a blank surface whether paper or fabric into a meaningful artwork by observing, imagining, and expressing their ideas through lines, shapes, and colours. Through this event, participants express emotions, perspectives, and creativity, turning imagination into visual form. Canvas encourages originality, focus, and artistic discipline, offering a space where creativity meets skill and expression comes to life. "
  },
  {
    "id": 25,
    "title":"Raag Mela",
    "date":"Coming Soon",
    "image":"https://res.cloudinary.com/dfugtz4v7/image/upload/v1769628490/raag_mela_nlyjsl.webp",
    "regLink":"",
    "description":"Alaap begins, the rhythm waits, and the night falls into tune.\nRaag Mela brings pure classical music to the stage; raw, precise, and timeless.\nNo fusion, no detours; just raags in their truest form, unfolding the way they’re meant to.\nEach note is deliberate.\nEach pause carries weight.\nThe music builds unhurried, holds you in the moment and lingers long after the final note fades.Performed by trained artists rooted in classical legacy.\nThis is a night for listening closely and feeling deeply."
  },{
    "id": 26,
    "title":"Panchayat",
    "date":"Coming Soon",
    "image":"/pic.jpg",
    "regLink":"https://forms.gle/vorRJb9sJeh19bSn6",
    "description":""
  }
]
